Que1" list any five functions of the pandas library with execution.

In [2]:
import lxml
import pandas as pd
url_data = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2022_per_game.html")

In [3]:
pip install lxml

Requirement already satisfied: lxml in /opt/conda/lib/python3.10/site-packages (4.9.2)
Note: you may need to restart the kernel to use updated packages.

In [4]:
type(url_data)

list

In [5]:
len(url_data)

1

In [6]:
df= url_data[0]

In [7]:
df

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9
2,3,Bam Adebayo,C,24,MIA,56,56,32.6,7.3,13.0,...,.753,2.4,7.6,10.1,3.4,1.4,0.8,2.6,3.1,19.1
3,4,Santi Aldama,PF,21,MEM,32,0,11.3,1.7,4.1,...,.625,1.0,1.7,2.7,0.7,0.2,0.3,0.5,1.1,4.1
4,5,LaMarcus Aldridge,C,36,BRK,47,12,22.3,5.4,9.7,...,.873,1.6,3.9,5.5,0.9,0.3,1.0,0.9,1.7,12.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
837,601,Thaddeus Young,PF,33,TOR,26,0,18.3,2.6,5.5,...,.481,1.5,2.9,4.4,1.7,1.2,0.4,0.8,1.7,6.3
838,602,Trae Young,PG,23,ATL,76,76,34.9,9.4,20.3,...,.904,0.7,3.1,3.7,9.7,0.9,0.1,4.0,1.7,28.4
839,603,Omer Yurtseven,C,23,MIA,56,12,12.6,2.3,4.4,...,.623,1.5,3.7,5.3,0.9,0.3,0.4,0.7,1.5,5.3
840,604,Cody Zeller,C,29,POR,27,0,13.1,1.9,3.3,...,.776,1.9,2.8,4.6,0.8,0.3,0.2,0.7,2.1,5.2
841,605,Ivica Zubac,C,24,LAC,76,76,24.4,4.1,6.5,...,.727,2.9,5.6,8.5,1.6,0.5,1.0,1.5,2.7,10.3

In [8]:
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9
2,3,Bam Adebayo,C,24,MIA,56,56,32.6,7.3,13.0,...,.753,2.4,7.6,10.1,3.4,1.4,0.8,2.6,3.1,19.1
3,4,Santi Aldama,PF,21,MEM,32,0,11.3,1.7,4.1,...,.625,1.0,1.7,2.7,0.7,0.2,0.3,0.5,1.1,4.1
4,5,LaMarcus Aldridge,C,36,BRK,47,12,22.3,5.4,9.7,...,.873,1.6,3.9,5.5,0.9,0.3,1.0,0.9,1.7,12.9

In [9]:
df.tail()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
837,601,Thaddeus Young,PF,33,TOR,26,0,18.3,2.6,5.5,...,.481,1.5,2.9,4.4,1.7,1.2,0.4,0.8,1.7,6.3
838,602,Trae Young,PG,23,ATL,76,76,34.9,9.4,20.3,...,.904,0.7,3.1,3.7,9.7,0.9,0.1,4.0,1.7,28.4
839,603,Omer Yurtseven,C,23,MIA,56,12,12.6,2.3,4.4,...,.623,1.5,3.7,5.3,0.9,0.3,0.4,0.7,1.5,5.3
840,604,Cody Zeller,C,29,POR,27,0,13.1,1.9,3.3,...,.776,1.9,2.8,4.6,0.8,0.3,0.2,0.7,2.1,5.2
841,605,Ivica Zubac,C,24,LAC,76,76,24.4,4.1,6.5,...,.727,2.9,5.6,8.5,1.6,0.5,1.0,1.5,2.7,10.3

In [10]:
df.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [11]:
df.dtypes

Rk        object
Player    object
Pos       object
Age       object
Tm        object
G         object
GS        object
MP        object
FG        object
FGA       object
FG%       object
3P        object
3PA       object
3P%       object
2P        object
2PA       object
2P%       object
eFG%      object
FT        object
FTA       object
FT%       object
ORB       object
DRB       object
TRB       object
AST       object
STL       object
BLK       object
TOV       object
PF        object
PTS       object
dtype: object

In [12]:
df[['Pos', 'Age', 'Tm', 'G']]

    Pos Age   Tm   G
0     C  22  TOR  73
1     C  28  MEM  76
2     C  24  MIA  56
3    PF  21  MEM  32
4     C  36  BRK  47
..   ..  ..  ...  ..
837  PF  33  TOR  26
838  PG  23  ATL  76
839   C  23  MIA  56
840   C  29  POR  27
841   C  24  LAC  76

[842 rows x 4 columns]

In [15]:
list(df.columns)

['Rk',
 'Player',
 'Pos',
 'Age',
 'Tm',
 'G',
 'GS',
 'MP',
 'FG',
 'FGA',
 'FG%',
 '3P',
 '3PA',
 '3P%',
 '2P',
 '2PA',
 '2P%',
 'eFG%',
 'FT',
 'FTA',
 'FT%',
 'ORB',
 'DRB',
 'TRB',
 'AST',
 'STL',
 'BLK',
 'TOV',
 'PF',
 'PTS']

In [18]:
df['Player']

0       Precious Achiuwa
1           Steven Adams
2            Bam Adebayo
3           Santi Aldama
4      LaMarcus Aldridge
             ...
837       Thaddeus Young
838           Trae Young
839       Omer Yurtseven
840          Cody Zeller
841          Ivica Zubac
Name: Player, Length: 842, dtype: object

In [19]:
df.describe

<bound method NDFrame.describe of       Rk             Player Pos Age   Tm   G  GS    MP   FG   FGA  ...   FT%  \
0      1   Precious Achiuwa   C  22  TOR  73  28  23.6  3.6   8.3  ...  .595
1      2       Steven Adams   C  28  MEM  76  75  26.3  2.8   5.1  ...  .543
2      3        Bam Adebayo   C  24  MIA  56  56  32.6  7.3  13.0  ...  .753
3      4       Santi Aldama  PF  21  MEM  32   0  11.3  1.7   4.1  ...  .625
4      5  LaMarcus Aldridge   C  36  BRK  47  12  22.3  5.4   9.7  ...  .873
..   ...                ...  ..  ..  ...  ..  ..   ...  ...   ...  ...   ...
837  601     Thaddeus Young  PF  33  TOR  26   0  18.3  2.6   5.5  ...  .481
838  602         Trae Young  PG  23  ATL  76  76  34.9  9.4  20.3  ...  .904
839  603     Omer Yurtseven   C  23  MIA  56  12  12.6  2.3   4.4  ...  .623
840  604        Cody Zeller   C  29  POR  27   0  13.1  1.9   3.3  ...  .776
841  605        Ivica Zubac   C  24  LAC  76  76  24.4  4.1   6.5  ...  .727

     ORB  DRB   TRB  AST  STL  BLK  TOV   PF   PTS
0    2.0  4.5   6.5  1.1  0.5  0.6  1.2  2.1   9.1
1    4.6  5.4  10.0  3.4  0.9  0.8  1.5  2.0   6.9
2    2.4  7.6  10.1  3.4  1.4  0.8  2.6  3.1  19.1
3    1.0  1.7   2.7  0.7  0.2  0.3  0.5  1.1   4.1
4    1.6  3.9   5.5  0.9  0.3  1.0  0.9  1.7  12.9
..   ...  ...   ...  ...  ...  ...  ...  ...   ...
837  1.5  2.9   4.4  1.7  1.2  0.4  0.8  1.7   6.3
838  0.7  3.1   3.7  9.7  0.9  0.1  4.0  1.7  28.4
839  1.5  3.7   5.3  0.9  0.3  0.4  0.7  1.5   5.3
840  1.9  2.8   4.6  0.8  0.3  0.2  0.7  2.1   5.2
841  2.9  5.6   8.5  1.6  0.5  1.0  1.5  2.7  10.3

[842 rows x 30 columns]>

Que2: given a pandas dataframe df with columns A, B , C write a python fun to re-index the dataframe with a new index that starts from 1 and increments by 2 for each row.

In [20]:
import pandas as pd

In [24]:
values =[ 3,5,1] , [8,2,7], [6,9,4], [2,3,5], [9,1,2]
df= pd.DataFrame(values, columns=['A', 'B', 'C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
df.reindex([1,2,3,4,5])

     A    B    C
1  8.0  2.0  7.0
2  6.0  9.0  4.0
3  2.0  3.0  5.0
4  9.0  1.0  2.0
5  NaN  NaN  NaN

yQue3: a pandas dataframe df with a column named valued .write a pyhon fun that iterates over the dataframe and calculate the sum of the first three values in the values column .the fun should print the sum to the console

In [4]:
import pandas as pd

In [11]:
values =[ 3,5,1] , [8,2,7], [6,9,4], [2,3,5], [9,1,2]
df= pd.DataFrame(values, columns=["sumit", "shital", "snehal"])
df

   sumit  shital  snehal
0      3       5       1
1      8       2       7
2      6       9       4
3      2       3       5
4      9       1       2

In [14]:
df['sumit'][0:3].sum()

17

Que4: a pandas dataframe pd with columna a,b,c .write a python fun that selects all rows where the values in column A is grater than 5 and the value in columb B is less than 10.

In [15]:
import pandas as pd

In [16]:
values =[ 3,5,1] , [8,2,7], [6,9,4], [2,3,5], [9,1,2]
df= pd.DataFrame(values, columns=['A', 'B', 'C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [20]:
df['A']>5

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [21]:
df['B']<10

0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool

Que5 :you have panas datafram df with a column date . write a fun that create a new column weekday in thr dataframe .

In [54]:
import pandas as pd
df = pd.DataFrame({'Date' : ['2023/01/01', '2023/01/02', '2023/01/03' , '2023/01/04', '2023/01/05']})
df

         Date
0  2023/01/01
1  2023/01/02
2  2023/01/03
3  2023/01/04
4  2023/01/05

In [55]:
type(df)

pandas.core.frame.DataFrame

In [56]:
import pandas as pd
df = pd.DataFrame({'Date' : ['2023/01/01', '2023/01/02', '2023/01/03' , '2023/01/04', '2023/01/05'],'Weekday':['sunday','monday','tuesday', 'wednesday','thursday']})
df

         Date    Weekday
0  2023/01/01     sunday
1  2023/01/02     monday
2  2023/01/03    tuesday
3  2023/01/04  wednesday
4  2023/01/05   thursday

Que6: how are DataFrame.size() and DataFrame.shape() different?

Ans: The shape of a dataframe is a tuple of array dimensions that tells the number of rows and columns of a given dataframe. the dataframe shape attribute in pandas enables us to obtain the shape of a dataframe

Que7: which fun of pandas do we use to read an excel file?

Ans:Read_ecxel() fun of pandas we use to read excel file

que8: to use the basic fun of pandas, what is the first and foremost necessary library that needs to be imported?

Ans: Read data

In [ ]:
Que: erite a pandas fun to calculate the mean,mode,

In [9]:
import pandas as  pd

In [10]:
student={'name':['udit' ,'rahul', 'shiva', 'saurabh', 'vijay', 'vinay'],'math':[70,45,45,66,77,88],'science':[98,67,88,77,89,78],'english':[96,55,66,87,88,78]}

In [23]:
df=pd.DataFrame(student)

In [24]:
df

      name  math  science  english
0     udit    70       98       96
1    rahul    45       67       55
2    shiva    45       88       66
3  saurabh    66       77       87
4    vijay    77       89       88
5    vinay    88       78       78

In [14]:
df.mean()

/tmp/ipykernel_70/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

math       65.166667
science    82.833333
english    78.333333
dtype: float64

In [15]:
df.sum()

name       uditrahulshivasaurabhvijayvinay
math                                   391
science                                497
english                                470
dtype: object

In [16]:
df.median()

/tmp/ipykernel_70/530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

math       68.0
science    83.0
english    82.5
dtype: float64

In [21]:
df.describe()

            math    science    english
count   6.000000   6.000000   6.000000
mean   65.166667  82.833333  78.333333
std    17.313771  10.980285  15.344923
min    45.000000  67.000000  55.000000
25%    50.250000  77.250000  69.000000
50%    68.000000  83.000000  82.500000
75%    75.250000  88.750000  87.750000
max    88.000000  98.000000  96.000000

In [26]:
df.std()

/tmp/ipykernel_70/3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

math       17.313771
science    10.980285
english    15.344923
dtype: float64